{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.13.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "48"}, {"size": "1662"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "104"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/temporal_attention_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/temporal_attention_1/dense_6_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/temporal_attention_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/temporal_attention_1/dense_7_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/temporal_attention_1/softmax_1_1/concat", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/temporal_attention_1/softmax_1_1/concat_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/temporal_attention_1/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1_2/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1_2/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_2_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_2_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "104"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_5_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "104"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/Max", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1662"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "48"}, {"size": "1662"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/forward_lstm_1_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1_2/backward_lstm_1_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1/num_elements"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/MatMul", "op": "BatchMatMulV2", "input": ["inputs", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/Cast/ReadVariableOp"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/MatMul", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"unknownRank": true}, {"dim": [{"size": "512"}]}]}}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/dense_1/BiasAdd", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/activation_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/batch_normalization_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/activation_1/Relu", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-15"}, {"size": "512"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/activation_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/activation_1/Relu", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "-15"}, {"size": "512"}]}, {"dim": [{"size": "3"}]}]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/activation_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/transpose", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/Shape", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice/stack", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/transpose", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/ReverseV2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/Shape", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice/stack", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/strided_slice", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/ReverseV2", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/strided_slice", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros/packed", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1/packed", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros/packed", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1/packed", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51", "op": "NoOp", "input": ["^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95", "op": "NoOp", "input": ["^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_44", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_47", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/Max", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_41", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/loop_counter", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/zeros_1", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/time", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_48", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_7", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_49", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_8", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_50", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_9", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/LoopControlInputs/_51"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2ZvcndhcmRfbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_88", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_86", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/Max", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_85", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/loop_counter", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_89", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_90", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/zeros_1", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_91", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_87", "op": "Enter", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/time", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_92", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_10", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_93", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_11", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/enter/_94", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_12", "^StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/backward_lstm_1/while/LoopControlInputs/_95"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvSVNMX0JpTFNUTV9BdHRuXzEvYmlkaXJlY3Rpb25hbF8xL2JhY2t3YXJkX2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/merge/_55", "op": "Merge", "input": ["StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/enter/_44", "StatefulPartitionedCall/ISL_BiLSTM_Attn_1/bidirectional_1/forward_lstm_1/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, 